#include "Monster.h"
#include "../Player.h"
#include "../Item/ItemManager.h"
#include "../Manager/PlayerManager.h"
#include "../MultiConsole/ConsoleController.h"
#include "../MultiConsole/ConsoleLogStream.h"

Monster::Monster() 
{
    
}

Monster::~Monster()
{
    
}

void Monster::TakeDamage()
{
  mHP =mHP - GetPlayer()->GetATK();
    
    if (mHP <= 0)
    {
        mHP = 0;
    }
    
    cout << "[" << monsterData.mName << "] "
      << "\033[94;40m" << GetPlayer()->GetATK() << "\033[0m"
      << " 만큼의 피해를 주었다!\n" << endl;
}

bool Monster::IsDeath()
{
    if (mHP <=0)
    {
        death = true;
    }
    
    else
    {
        death = false;
    }
    return death;
}

int Monster::GetHP()
{
    return mHP;
}

int Monster::GetExp()
{
    return monsterData.exp;
}

int Monster::GetDropGold()
{
    return monsterData.gold;
}

string Monster::GetName()
{
    return monsterData.mName;
}

int Monster::GetMaxHp()
{
    return Max_mHP;
}

int Monster::GetATK()
{
    return mATK;
}


void Monster::SetStat()
{
    int randHP = rand() % 11 + 20; //랜덤 구현 -> 플레이어 레벨 x20~30중 무작위 (11가지 가짓수)
    int randATK = rand() % 6 + 5;  //랜덤 구현 -> 플레이어 레벨 x 5~10중 무작위 (6가지 가짓수)
    
   mHP = GetPlayer()->GetLevel()*randHP; 
    Max_mHP =mHP;
   mATK = GetPlayer()->GetLevel()*randATK; 
    
}

void Monster::SetExp(int exp)
{
    monsterData.exp = exp;
}

void Monster::SetName(string name)
{
    monsterData.mName = name;
}


void Monster::SetGold(int gold)
{
    monsterData.gold = gold;
}

void Monster::SetDropItem(EItem dropItem)
{
    int randValue = rand() % 100;
    if (randValue < 60)
    {
        monsterData.dropItem = dropItem;
    }
    else if (randValue < 30)
    {
        monsterData.dropItem = EItem::Berry;
    }    
    else if (randValue < 30)
    {
        monsterData.dropItem = EItem::Water;
    }
    else
    {
        monsterData.dropItem = EItem::Herb;
    }
}

void Monster::SetBossStat()
{
    int randHP = rand() % 11 + 20; //랜덤 구현 -> 플레이어 레벨 x20~30중 무작위 (11가지 가짓수)
    int randATK = rand() % 6 + 5;  //랜덤 구현 -> 플레이어 레벨 x 5~10중 무작위 (6가지 가짓수)
    
   mHP = (GetPlayer()->GetLevel()*randHP)*4;
   
   mATK = (GetPlayer()->GetLevel()*randATK)*4;
}

EItem Monster::GetDropItem()
{
    return monsterData.dropItem;
}


void Monster::AsciiArt()
{
    
    C_LOG(EConsoleTag::LargePopup) << 
        R"(
                       #   #  ###  ####  #   # #   # ### #   #  ###                 
                       #   # #   # #   # ##  # ##  #  #  ##  # #                    
        #### #### #### # # # ##### ####  # # # # # #  #  # # # #  ## #### #### #### 
                       ## ## #   # #  #  #  ## #  ##  #  #  ## #   #                
                       #   # #   # #   # #   # #   # ### #   #  ###                            
                  
                   ################$=$$$$##############$$############
                   ###############$=*##$###$##@#$$#@@#@###$##########
                   ############$$#$$#$$$####$$#$$#@@@################
                   ############$$$#$*$$#$$==**$#$=$#########$########
                   ##############$$=$$###$$=#$$#$$$#####$############
                   ############$#$###$$#$$###$$$$####$######@########
                   ###############=$=$#$$$$#=$$###$$$$=*=##$#########
                   ##########$###$=$#$$=$==$$$$$$=**!!;;;$@$######### 
                   ##########$###$=#$==*=*$$$$$=*;:~~~~~:*#$#########
                   #############$$$$$$==*=#$$$=!:--,,,--~;$$###$#####
                   #########$$###=*$*$===$*$$=!~-,..,,,--~=$$########
                   #########$#$====*===$=$==*;~,......,,-~!$=########
                   #########$$$$$==$$#$*=**!;~,.......,,-~;$$########
                   #########===#$===*====*$*:,.......,-~~~~$$$=######
                   #########==*=$$$#$**====!:-,......~;!!;:$##$$#####
                   #########===$#$#$$=*==!;;;:~,....-;!:::;=##$#####$
                   #########==$###$#=!!;~,.,,,,,,.,,-~---~~;######$##
                   #########$==####$:,............,,-,,,-~~-##$##$###
                   #########$==$$##=,.......,,,....,,.,-~~--##$$$####
                   #########$=$=$##$. ....-!=~:-. .-,~*!;:~-#$$$#####
                   ##########$$$###$.   .,,,~--~, .-,,--~~--##$######
                   ##########$$=$#$* ..  ....,-,...-,,,,----$$#######
                   ##########$;--*$!..    .....   .,,,....,-=########
                   ###########*,.-*:...   .....    ,,,.....,!########
                   ###########$~..!,...     ...    .,,.....,*########
                   ############:  :....     ....   .-,.....,*#######$
                   ############;..,....     .....  .--,...,,=#######$
                   ############=-......     ..--  ..---,..,-#######$$
                   #############=*,...... ...,,..,,,~--,.,,-#######$$
                   ##############$-.........,,....,,---,,,,-######$$#
                   ###############,.................,--,,,--######$$#
                   ##############$*............. ...,---,,-;######$##
                   #############$$=..........-~-,,,~!:--,,-$#####$$##
                   #############$;:........... ....,---,,-:$#####$###
                   #############$:, ,........    ...,,,,-~=######$###
                   #############$$!~--,.......  ....,,,--;$#####$$###
                   #############$$$$;!.,,...........,,,-:=######$####
                   #############$$$$==:,,,.........,,---!######$$####
                   ############$$$$$$$=:--,,,,.....,,--;$######$#####
                   ############$$$$$$$$=;.,,,,,,,,,,-~:$######$$#####
                   ###########$$$$#$$$$$$!..~------~:::!######$######
                   #########=$$$$####$$$$$;  .~~::;::~::*####$###$$$$
                   ######$===$$$##$$#$$$$$$-     -~~~~:~;$###$##$$###
                   ##$$$====$$$$$#$$##$$$$$=-    .-~:,---!##$$#$$####
                   =****===$$$$$$$##@#$$$$$$=.  -;.,,,:~-!$$$$$$$####
                   ******===$$$$$$$####$$$$$=: .:=,.,.--:=$##$$$$$###
                   ===***===$$$$$$$$##$$$$$$$*..,-...,:-;$$$$#$$$$$$#
                   ==*!!*=====$$$$$$$$$$$$$=$$;.....,,:;=$$$$$#####$$
                   $=*!**======$$$$$$$$$$$$=$$*~.    ,~*#$$$$$######$
                   $=*!!*=======$$$$$$$$##$$$$$;..  ;,-!#$$$$$$######

)";
    ConsoleController::GetInstance()->CloseConsole(EConsoleTag::LargePopup);
}

